--СТАТИСТИКА

-----------------------------------------------------
--Среднее 
-----------------------------------------------------

WITH tmp (sales_date, sales) AS (
	VALUES 
	('2023-01-01'::date, 200::int),
	('2023-03-01', 100),
	('2023-04-01', 300),
	('2023-05-01', 200),
	('2023-10-01', 800)
)
SELECT 
	avg(sales)
FROM tmp

/*
avg                 |
--------------------+
320.0000000000000000|
*/

-----------------------------------------------------
--Медиана
-----------------------------------------------------

WITH tmp (sales_date, sales) AS (
	VALUES 
	('2023-01-01'::date, 200::int),
	('2023-03-01', 100),
	('2023-04-01', 300),
	('2023-05-01', 200),
	('2023-10-01', 1800)
)
SELECT 
	percentile_disc(.5) WITHIN GROUP (ORDER BY sales)  AS median
FROM tmp

/*
median|
------+
   200|
*/

---------------------------------------------------------------------
--Уберем выбросы (крайний пик > 95% от отсортированного списка)
--------------------------------------------------------------------

WITH tmp (sales_date, sales) AS (
	VALUES 
	('2023-01-01'::date, 200::int),
	('2023-03-01', 100),
	('2023-04-01', 300),
	('2023-05-01', 200),
	('2023-10-01', 1800)
)
SELECT 
	avg(sales)
FROM tmp
WHERE sales NOT IN (
				SELECT 	percentile_disc(.95) WITHIN GROUP (ORDER BY sales)
				FROM tmp)

/*
avg                 |
--------------------+
200.0000000000000000|
 */






